// Завдання 1. Напишіть скрипт, який запитує у користувача два числа: «х» та «у», порівнює їх величини і виводить одне з повідомлень: «x > y», «x < y» або «x = y» залежно від введених даних.
let first_number = +prompt('Введіть, будь ласка, число x...');
let second_number = +prompt('Введіть, будь ласка, число y...');

if (first_number > second_number){
  alert('x > y');
}
else if (first_number < second_number){
  alert('x < y');
}
else if (first_number === second_number){
  alert('x = y');
}
else {
  alert('Ви ввели некоректні значення чисел');
}

// Завдання 2. Використовуючи if..else , напишіть код, що отримує число задопомогою prompt і потім виводить повідомлення alert :
// Ваше значення більше нуля , якщо значення більше нуля,
// Ваше значення менше нуля , якщо менше,
// Ваше значення дорівнює нулю , якщо дорівнює нулю.

let number = +prompt('Введіть, будь ласка, число...');
if (number > 0){
  alert('Ваше значення більше нуля.');
}
else if (number < 0){
  alert('Ваше значення менше нуля.');
}
else if (number === 0){
  alert('Ваше значення дорівнює нулю.');
}
else {
  alert('Ви ввели некоректні значення числа.');
}

// Завдання 3. Напишіть умову if , щоб перевірити, чи age знаходиться між 18 та 90 включно (..тобто age може досягати країв 18 або 90 ).
let age = +prompt('Введіть, будь ласка, Ваш вік...');
if (age>=18 && age<=90){
  alert('Ваш вік знаходиться в межах від 18 до 90 років.');
}
else{
  alert('Ваш вік або менше 18 років, або більше 90 років.')
}
/*Завдання 4. Напишіть код, який запитує логін за допомогою prompt .
Якщо відвідувач вводить "Admin" , тоді запропонуйте за допомогою prompt ввести
пароль. Якщо введено порожній рядок або натиснуто Esc – показати “Скасовано”.
Якщо введено інший рядок – тоді покажіть “Я вас не знаю”.
Пароль перевіряється наступним чином:
Якщо він дорівнює “Господар”, тоді покажіть “Ласкаво просимо!”,
Інший рядок – покажіть “Неправильний пароль”,
Для порожнього рядка, або якщо введення було скасовано, покажіть
“Скасовано”.*/

let login = prompt("Введіть, будь ласка, Ваш логін...");
if (login == '' || login == null) {
  alert("Скасовано.");
} else if (login === "Admin") {
  let pass = prompt("Введіть, будь ласка, Ваш пароль...");
    if (pass == "" || pass == null) {
      alert("Скасовано.");
    } else if (pass == "Господар") {
      alert("Ласкаво просимо!");
    } else {
      alert("Неправильний пароль");
    }
} else if (login !== "Admin") {
  alert("Я Вас не знаю.");
}
